app/controllers/challenges_controller.rb

SELECT * FROM `challenges`
---
  def index
    @challenges = Challenge.all

SELECT * FROM `challenges` WHERE (`challenges`.`id` = 1)
---
  def show
    @challenge = Challenge.find(params[:id])

INSERT INTO `challenges` (`name`, `created_at`, `updated_at`, `points`, `place_name`, `placeID`, `user_id`, `description`, `question`, `message`, `answer`) VALUES('沸腾鱼乡', '2010-09-19 14:22:36', '2010-09-19 14:22:36', 3, '沸腾鱼乡', 2, NULL, '沸腾鱼乡', '沸腾鱼乡', NULL, '沸腾鱼乡')
---
  def create
    @challenge = Challenge.new(params[:challenge])

    respond_to do |format|
      if @challenge.save