app/controllers/index_controller.rb

  def index
    userid = session[:user_id]
    if userid
      @user = User.find(userid)
---
SELECT * FROM `users` WHERE (`users`.`id` = 3)