app/controllers/place_tag_controller.rb

  def create

     @place_tag = PlaceTag.new
     @place_tag.place_id = params[:place_id]
     @place_tag.tag_name = params[:tag_name]
     @place_tag.user_id = params[:user_id]

     if request.xhr?
         request.format = :js
     end

     respond_to do |format|
       if @place_tag.save
---
INSERT INTO `place_tags` (`place_id`, `created_at`, `updated_at`, `user_id`, `place_attr_id`, `tag_name`) VALUES(2, '2010-09-30 08:06:46', '2010-09-30 08:06:46', 1, NULL, '我家')