app/controllers/places_controller.rb

  def index
    @places = Place.all
---
SELECT * FROM `places`

  def show
    #@place = Place.find(params[:id])
    # get the current location from incming parameters
    if is_iphone_request?

            current_lat = params[:current_lat].to_f
            current_lng = params[:current_lng].to_f
           # caculate the boundary of rectangle
            lat_NE = current_lat + 5/111.0
            lng_NE = current_lng + 5/111.0
            lat_SW = current_lat - 5/111.0
            lng_SW = current_lng - 5/111.0

            # run query from place database
            @place = Place.find(:all,
                                :conditions => ["longtitude BETWEEN ? and ? and latitue BETWEEN ? and ?",lng_SW, lng_NE,lat_SW, lat_NE])
---
SELECT * FROM `places` WHERE (longtitude BETWEEN 116.273329454955 and 116.363419545045 and latitue BETWEEN 39.934050154955 and 40.024140245045)

  def show_challenges
     @place = Place.find(params[:id])
---
SELECT * FROM `places` WHERE (`places`.`id` = 1)

  def edit
    @place = Place.find(params[:id])
---
SELECT * FROM `places` WHERE (`places`.`id` = 9)

  def create
    @place = Place.new(params[:place])
    @place.save!
---
INSERT INTO `places` (`name`, `city`, `address`, `longtitude`, `created_at`, `attr_id`, `updated_at`, `postalcode`, `user_id`, `description`, `latitue`, `state`) VALUES('中关村中学', '北京', '中关村中学', 116.32668, '2010-09-28 06:58:47', NULL, '2010-09-28 06:58:47', '', NULL, '', 39.978497, '北京市')