app/controllers/users_controller.rb

  def show
    #get the user id from seesion
    @user = User.find(session[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 0)

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `isloading`, `profile_image_url`, `placevisitedcount`, `created_at`, `challengcount`, `updated_at`, `hashed_password`, `sinaauthenticated`, `e_mail`) VALUES('nate', '21643972000.238966166012259', NULL, NULL, NULL, '2010-09-17 04:35:09', NULL, '2010-09-17 04:35:09', 'd669164e68ff1454b73e9799a230525ad550b388', NULL, 'cuiyingsan@gmail.com')