app/controllers/user_activity_controller.rb

INSERT INTO `user_activities` (`challenge_points`, `place_id`, `challenge_tweet`, `created_at`, `challenge_id`, `checkin_type_id`, `updated_at`, `points`, `user_id`, `challenge_answer`) VALUES(NULL, NULL, NULL, '2010-09-28 14:24:50', NULL, NULL, '2010-09-28 14:24:50', NULL, NULL, NULL)
INSERT INTO `user_scores` (`created_at`, `scores`, `updated_at`, `challenges_done_count`, `user_id`, `challenges_create_count`, `places_visited_count`) VALUES('2010-09-29 08:06:32', 3, '2010-09-29 08:06:32', 1, 1, NULL, 1)
---
  def create
    @user_activity = UserActivity.new
    @user_activity.checkin_type_id = params[:checkin_type_id]
		@user_activity.user_id = params[:user_id]
		@user_activity.place_id = params[:place_id]
		@user_activity.points = params[:points]

   # add current activity's points into user_scores table.
   if @user_activity.user_score
        @user_activity.user_score.scores = @user_activity.user_score.scores + 	@user_activity.points
        @user_activity.user_score.places_visited_count = @user_activity.user_score.places_visited_count + 1
        @user_activity.user_score.challenges_done_count =   @user_activity.user_score.challenges_done_count + 1
        @user_activity.user_score.save

SELECT * FROM `user_activities` WHERE (place_id = '2') ORDER BY created_at DESC
---
  def show
     place_id = params[:place_id]
     user_id  = params[:user_id]
     if place_id
         @user_activity = UserActivity.find(:all,
                              :conditions => ["place_id = ?",place_id])